import sqlite3

conn = sqlite3.connect("database/emart.db")
cursor = conn.cursor()

product_types = [

    ("조미식품", "설탕", "880100000001"),
    ("조미식품", "밀가루", "880100000002"),
    ("조미식품", "부침가루", "880100000003"),

    ("즉석식품", "즉석밥", "880100000004"),
    ("즉석식품", "즉석밥", "880100000005"),

    ("라면", "봉지라면", "880200000001"),
    ("라면", "멀티팩", "880200000002"),
    ("라면", "봉지라면", "880200000003"),

    ("과자", "스낵", "880200000004"),
    ("과자", "스낵", "880200000005"),

    ("라면", "봉지라면", "880300000001"),
    ("라면", "봉지라면", "880300000002"),
    ("라면", "멀티팩", "880300000003"),

    ("즉석식품", "카레", "880300000004"),
    ("즉석식품", "카레", "880300000005"),

    ("과자", "초코과자", "880400000001"),
    ("과자", "초코과자", "880400000002"),
    ("과자", "초코과자", "880400000003"),

    ("과자", "초코과자", "880400000004"),
    ("과자", "초코과자", "880400000005"),

    ("음료", "탄산음료", "880500000001"),
    ("음료", "탄산음료", "880500000002"),
    ("음료", "탄산음료", "880500000003"),

    ("음료", "탄산음료", "880500000004"),
    ("음료", "탄산음료", "880500000005"),
    ("음료", "탄산음료", "880500000006")
]

cursor.executemany("""
INSERT INTO ProductType(
    name,
    description,
    productBarcode
)
VALUES (?, ?, ?)
""", product_types)

conn.commit()
conn.close()

print("ProductType 데이터 추가 완료")